Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70b/edc/ATSAMV70Q20B.PIC
      <edc:SFRDef edc:_addr="0x40008014" edc:access="---------------------www----wwww" edc:cname="SPI0_IER" edc:impl="0x70F" edc:nzwidth="0x20" ltx:memberofperipheral="SPI0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI0">
            <edc:SFRFieldDef edc:cname="RDRF" edc:desc="Receive Data Register Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:desc="SPI Transmit Data Register Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:desc="Mode Fault Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:desc="NSS Rising Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmission Registers Empty Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:desc="Underrun Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40008018" edc:access="---------------------www----wwww" edc:cname="SPI0_IDR" edc:impl="0x70F" edc:nzwidth="0x20" ltx:memberofperipheral="SPI0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI0">
            <edc:SFRFieldDef edc:cname="RDRF" edc:desc="Receive Data Register Full Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:desc="SPI Transmit Data Register Empty Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:desc="Mode Fault Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:desc="Overrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:desc="NSS Rising Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmission Registers Empty Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:desc="Underrun Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000801C" edc:access="---------------------rrr----rrrr" edc:cname="SPI0_IMR" edc:impl="0x70F" edc:nzwidth="0x20" ltx:memberofperipheral="SPI0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI0">
            <edc:SFRFieldDef edc:cname="RDRF" edc:desc="Receive Data Register Full Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:desc="SPI Transmit Data Register Empty Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:desc="Mode Fault Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:desc="Overrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:desc="NSS Rising Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmission Registers Empty Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:desc="Underrun Error Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40008020" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x40008030" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPI0_CSR0" edc:nzwidth="0x20" ltx:memberofperipheral="SPI0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI0">
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Clock Polarity" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="IDLE_LOW" edc:desc="Clock is low when inactive (CPOL=0)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IDLE_HIGH" edc:desc="Clock is high when inactive (CPOL=1)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NCPHA" edc:desc="Clock Phase" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALID_LEADING_EDGE" edc:desc="Data is valid on clock leading edge (CPHA=0)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="VALID_TRAILING_EDGE" edc:desc="Data is valid on clock trailing edge (CPHA=1)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSNAAT" edc:desc="Chip Select Not Active After Transfer (Ignored if CSAAT = 1)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSAAT" edc:desc="Chip Select Active After Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BITS" edc:desc="Bits Per Transfer" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8 bits for transfer" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_9_BIT" edc:desc="9 bits for transfer" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_10_BIT" edc:desc="10 bits for transfer" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_11_BIT" edc:desc="11 bits for transfer" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_12_BIT" edc:desc="12 bits for transfer" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_13_BIT" edc:desc="13 bits for transfer" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_14_BIT" edc:desc="14 bits for transfer" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_15_BIT" edc:desc="15 bits for transfer" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="_16_BIT" edc:desc="16 bits for transfer" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCBR" edc:desc="Serial Clock Bit Rate" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYBS" edc:desc="Delay Before SPCK" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:desc="Delay Between Consecutive Transfers" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40008034" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPI0_CSR1" edc:nzwidth="0x20" ltx:memberofperipheral="SPI0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI0">
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Clock Polarity" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="IDLE_LOW" edc:desc="Clock is low when inactive (CPOL=0)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IDLE_HIGH" edc:desc="Clock is high when inactive (CPOL=1)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NCPHA" edc:desc="Clock Phase" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALID_LEADING_EDGE" edc:desc="Data is valid on clock leading edge (CPHA=0)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="VALID_TRAILING_EDGE" edc:desc="Data is valid on clock trailing edge (CPHA=1)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSNAAT" edc:desc="Chip Select Not Active After Transfer (Ignored if CSAAT = 1)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSAAT" edc:desc="Chip Select Active After Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BITS" edc:desc="Bits Per Transfer" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8 bits for transfer" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_9_BIT" edc:desc="9 bits for transfer" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_10_BIT" edc:desc="10 bits for transfer" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_11_BIT" edc:desc="11 bits for transfer" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_12_BIT" edc:desc="12 bits for transfer" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_13_BIT" edc:desc="13 bits for transfer" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_14_BIT" edc:desc="14 bits for transfer" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_15_BIT" edc:desc="15 bits for transfer" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="_16_BIT" edc:desc="16 bits for transfer" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCBR" edc:desc="Serial Clock Bit Rate" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYBS" edc:desc="Delay Before SPCK" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:desc="Delay Between Consecutive Transfers" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
