Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70b/edc/ATSAMV70Q20B.PIC
      <edc:SFRDef edc:_addr="0x4003823C" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:cname="USBHS_DEVEPTIDR7" edc:impl="0xB57FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:desc="MData Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:desc="DataX Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:desc="Transaction Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038240" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:cname="USBHS_DEVEPTIDR8" edc:impl="0xB57FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:desc="MData Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:desc="DataX Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:desc="Transaction Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038244" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:cname="USBHS_DEVEPTIDR9" edc:impl="0xB57FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:desc="Transmitted IN Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:desc="Received OUT Data Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:desc="Underflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:desc="Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:desc="STALLed Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:desc="Shortpacket Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:desc="MData Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:desc="DataX Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:desc="Transaction Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:desc="Endpoint Interrupts Disable HDMA Request Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:desc="NYET Token Disable Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:desc="STALL Request Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038248" edc:offset="0xC8"/>
      <edc:SFRDef edc:_addr="0x40038310" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_DEVDMA0USBHS_DEVDMANXTDSC" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:desc="Next Descriptor Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038314" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_DEVDMA0USBHS_DEVDMAADDRESS" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:desc="Buffer Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
