Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70b/edc/ATSAMV70Q20B.PIC
      <edc:AdjustPoint edc:_addr="0x40088064" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x40088080" edc:access="--nn--nn--nn--nn--nn--nn--nn--nn" edc:cname="MATRIX_PR0MATRIX_PRAS" edc:impl="0x33333333" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:desc="Master 4 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:desc="Master 5 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:desc="Master 6 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:desc="Master 7 Priority" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40088084" edc:access="--------------nn--nn--nn------nn" edc:cname="MATRIX_PR0MATRIX_PRBS" edc:impl="0x33303" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:desc="Master 8 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:desc="Master 10 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:desc="Master 11 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:desc="Master 12 Priority" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40088088" edc:access="--nn--nn--nn--nn--nn--nn--nn--nn" edc:cname="MATRIX_PR1MATRIX_PRAS" edc:impl="0x33333333" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:desc="Master 4 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:desc="Master 5 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:desc="Master 6 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:desc="Master 7 Priority" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4008808C" edc:access="--------------nn--nn--nn------nn" edc:cname="MATRIX_PR1MATRIX_PRBS" edc:impl="0x33303" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:desc="Master 8 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:desc="Master 10 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:desc="Master 11 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:desc="Master 12 Priority" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40088090" edc:access="--nn--nn--nn--nn--nn--nn--nn--nn" edc:cname="MATRIX_PR2MATRIX_PRAS" edc:impl="0x33333333" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:desc="Master 4 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:desc="Master 5 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:desc="Master 6 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:desc="Master 7 Priority" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40088094" edc:access="--------------nn--nn--nn------nn" edc:cname="MATRIX_PR2MATRIX_PRBS" edc:impl="0x33303" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:desc="Master 8 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:desc="Master 10 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:desc="Master 11 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:desc="Master 12 Priority" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40088098" edc:access="--nn--nn--nn--nn--nn--nn--nn--nn" edc:cname="MATRIX_PR3MATRIX_PRAS" edc:impl="0x33333333" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:desc="Master 4 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:desc="Master 5 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:desc="Master 6 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:desc="Master 7 Priority" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
