Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70b/edc/ATSAMV70Q20B.PIC
      <edc:SFRDef edc:_addr="0x4009000C" edc:access="----------ww----------ww-w---w--" edc:cname="I2SC1_SCR" edc:impl="0x300344" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:desc="Receive Overrun Status Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:desc="Transmit Underrun Status Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXORCH" edc:desc="Receive Overrun Per Channel Status Clear" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="TXURCH" edc:desc="Transmit Underrun Per Channel Status Clear" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40090010" edc:access="----------ww----------ww-w---w--" edc:cname="I2SC1_SSR" edc:impl="0x300344" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:desc="Receive Overrun Status Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:desc="Transmit Underrun Status Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXORCH" edc:desc="Receive Overrun Per Channel Status Set" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="TXURCH" edc:desc="Transmit Underrun Per Channel Status Set" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40090014" edc:access="-------------------------ww--ww-" edc:cname="I2SC1_IER" edc:impl="0x66" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:desc="Receiver Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:desc="Transmit Underflow Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40090018" edc:access="-------------------------ww--ww-" edc:cname="I2SC1_IDR" edc:impl="0x66" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:desc="Receiver Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:desc="Transmit Underflow Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4009001C" edc:access="-------------------------rr--rr-" edc:cname="I2SC1_IMR" edc:impl="0x66" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:desc="Receiver Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:desc="Transmit Underflow Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40090020" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="I2SC1_RHR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:SFRFieldDef edc:cname="RHR" edc:desc="Receiver Holding Register" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40090024" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="I2SC1_THR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC1">
            <edc:SFRFieldDef edc:cname="THR" edc:desc="Transmitter Holding Register" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40090028" edc:offset="0x503E8"/>
      <edc:SFRDef edc:_addr="0x400E0410" edc:access="--------n-----------------nn---n" edc:cname="UTMI_OHCIICR" edc:impl="0x800031" edc:nzwidth="0x20" ltx:memberofperipheral="UTMI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UTMI">
            <edc:SFRFieldDef edc:cname="RES0" edc:desc="USB PORTx Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ARIE" edc:desc="OHCI Asynchronous Resume Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APPSTART" edc:desc="Reserved" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x11"/>
            <edc:SFRFieldDef edc:cname="UDPPUDIS" edc:desc="USB Device Pull-up Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0414" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x400E0430" edc:access="------------------------------nn" edc:cname="UTMI_CKTRIM" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="UTMI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UTMI">
            <edc:SFRFieldDef edc:cname="FREQ" edc:desc="UTMI Reference Clock Frequency" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="XTAL12" edc:desc="12 MHz reference clock" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="XTAL16" edc:desc="16 MHz reference clock" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0434" edc:offset="0x1CC"/>
      <edc:SFRDef edc:_addr="0x400E0600" edc:access="----------------wwwwwwww--w-----" edc:cname="PMC_SCER" edc:impl="0xFF20" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="USBCLK" edc:desc="Enable USB FS Clock" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:desc="Programmable Clock 0 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:desc="Programmable Clock 1 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:desc="Programmable Clock 2 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:desc="Programmable Clock 3 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK4" edc:desc="Programmable Clock 4 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK5" edc:desc="Programmable Clock 5 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK6" edc:desc="Programmable Clock 6 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK7" edc:desc="Programmable Clock 7 Output Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0604" edc:access="----------------wwwwwwww--w-----" edc:cname="PMC_SCDR" edc:impl="0xFF20" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="USBCLK" edc:desc="Disable USB FS Clock" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:desc="Programmable Clock 0 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:desc="Programmable Clock 1 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:desc="Programmable Clock 2 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:desc="Programmable Clock 3 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK4" edc:desc="Programmable Clock 4 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK5" edc:desc="Programmable Clock 5 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK6" edc:desc="Programmable Clock 6 Output Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK7" edc:desc="Programmable Clock 7 Output Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0608" edc:access="----------------rrrrrrrr--r----r" edc:cname="PMC_SCSR" edc:impl="0xFF21" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="HCLKS" edc:desc="HCLK Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="USBCLK" edc:desc="USB FS Clock Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:desc="Programmable Clock 0 Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:desc="Programmable Clock 1 Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:desc="Programmable Clock 2 Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:desc="Programmable Clock 3 Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK4" edc:desc="Programmable Clock 4 Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK5" edc:desc="Programmable Clock 5 Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK6" edc:desc="Programmable Clock 6 Output Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCK7" edc:desc="Programmable Clock 7 Output Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E060C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E0610" edc:access="wwwwwwwwwwwwwwwwwwwwwwwww-------" edc:cname="PMC_PCER0" edc:impl="0xFFFFFF80" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:desc="Peripheral Clock 7 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:desc="Peripheral Clock 8 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:desc="Peripheral Clock 9 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:desc="Peripheral Clock 10 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:desc="Peripheral Clock 11 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID12" edc:desc="Peripheral Clock 12 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:desc="Peripheral Clock 13 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:desc="Peripheral Clock 14 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:desc="Peripheral Clock 15 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:desc="Peripheral Clock 16 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:desc="Peripheral Clock 17 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:desc="Peripheral Clock 18 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:desc="Peripheral Clock 19 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:desc="Peripheral Clock 20 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:desc="Peripheral Clock 21 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:desc="Peripheral Clock 22 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:desc="Peripheral Clock 23 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:desc="Peripheral Clock 24 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:desc="Peripheral Clock 25 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:desc="Peripheral Clock 26 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:desc="Peripheral Clock 27 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:desc="Peripheral Clock 28 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:desc="Peripheral Clock 29 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:desc="Peripheral Clock 30 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:desc="Peripheral Clock 31 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
