Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70b/edc/ATSAMV70Q20B.PIC
      <edc:SFRDef edc:_addr="0x400E1A08" edc:access="----------------w-----w-www---ww" edc:cname="UART2_IER" edc:impl="0x82E3" edc:nzwidth="0x20" ltx:memberofperipheral="UART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Enable RXRDY Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Enable TXRDY Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Enable Overrun Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Enable Framing Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Enable Parity Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Enable TXEMPTY Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:desc="Enable Comparison Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1A0C" edc:access="----------------w-----w-www---ww" edc:cname="UART2_IDR" edc:impl="0x82E3" edc:nzwidth="0x20" ltx:memberofperipheral="UART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Disable RXRDY Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Disable TXRDY Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Disable Overrun Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Disable Framing Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Disable Parity Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Disable TXEMPTY Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:desc="Disable Comparison Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1A10" edc:access="----------------r-----r-rrr---rr" edc:cname="UART2_IMR" edc:impl="0x82E3" edc:nzwidth="0x20" ltx:memberofperipheral="UART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Mask RXRDY Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Disable TXRDY Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Mask Overrun Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Mask Framing Error Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Mask Parity Error Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Mask TXEMPTY Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:desc="Mask Comparison Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1A14" edc:access="----------------r-----r-rrr---rr" edc:cname="UART2_SR" edc:impl="0x82E3" edc:nzwidth="0x20" ltx:memberofperipheral="UART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmitter Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Framing Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Parity Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmitter Empty" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:desc="Comparison Match" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1A18" edc:access="------------------------rrrrrrrr" edc:cname="UART2_RHR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="UART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART2">
            <edc:SFRFieldDef edc:cname="RXCHR" edc:desc="Received Character" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1A1C" edc:access="------------------------wwwwwwww" edc:cname="UART2_THR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="UART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART2">
            <edc:SFRFieldDef edc:cname="TXCHR" edc:desc="Character to be Transmitted" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1A20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="UART2_BRGR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="UART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART2">
            <edc:SFRFieldDef edc:cname="CD" edc:desc="Clock Divisor" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
