Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70b/edc/ATSAMV70Q20B.PIC
      <edc:SFRDef edc:_addr="0xE000ED9C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RBAR" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="MPU region field." edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="VALID" edc:desc="MPU Region Number valid bit." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Region base address field." edc:nzwidth="0x1B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDA0" edc:access="---n-nnn--nnnnnnnnnnnnnn--nnnnnn" edc:cname="RASR" edc:impl="0x173FFF3F" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Region enable bit." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="Specifies the size of the MPU protection region." edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SRD" edc:desc="Subregion disable bits." edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="B" edc:desc="MPU access permission attributes." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C" edc:desc="MPU access permission attributes." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S" edc:desc="Shareable bit." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEX" edc:desc="MPU access permission attributes." edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AP" edc:desc="Access permission field." edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XN" edc:desc="Instruction access disable bit." edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDA4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RBAR_A1" edc:nzwidth="0x20" ltx:memberofperipheral="MPU"/>
      <edc:SFRDef edc:_addr="0xE000EDA8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RASR_A1" edc:nzwidth="0x20" ltx:memberofperipheral="MPU"/>
      <edc:SFRDef edc:_addr="0xE000EDAC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RBAR_A2" edc:nzwidth="0x20" ltx:memberofperipheral="MPU"/>
      <edc:SFRDef edc:_addr="0xE000EDB0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RASR_A2" edc:nzwidth="0x20" ltx:memberofperipheral="MPU"/>
      <edc:SFRDef edc:_addr="0xE000EDB4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RBAR_A3" edc:nzwidth="0x20" ltx:memberofperipheral="MPU"/>
      <edc:SFRDef edc:_addr="0xE000EDB8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RASR_A3" edc:nzwidth="0x20" ltx:memberofperipheral="MPU"/>
      <edc:AdjustPoint edc:_addr="0xE000EDBC" edc:offset="0x144"/>
      <edc:SFRDef edc:_addr="0xE000EF00" edc:access="-----------------------wwwwwwwww" edc:cname="STIR" edc:impl="0x1FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SCB NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="INTID" edc:desc="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3." edc:nzwidth="0x9"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="INTID" edc:desc="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3." edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000EF04" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0xE000EF34" edc:access="nn---------------------n-nnnn-nn" edc:cname="FPCCR" edc:impl="0xC000017B" edc:mclr="11000000000000000000000000000000" edc:nzwidth="0x20" edc:por="11000000000000000000000000000000" ltx:memberofperipheral="FPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPU">
            <edc:SFRFieldDef edc:cname="LSPACT" edc:desc="Lazy state preservation is active. Floating-point stack frame has been allocated but saving state to it has been deferred." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER" edc:desc="Privilege level was user when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="THREAD" edc:desc="Mode was Thread Mode when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HFRDY" edc:desc="Priority permitted setting the HardFault handler to the pending state when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MMRDY" edc:desc="MemManage is enabled and priority permitted setting the MemManage handler to the pending state when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BFRDY" edc:desc="BusFault is enabled and priority permitted setting the BusFault handler to the pending state when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MONRDY" edc:desc="DebugMonitor is enabled and priority permits setting MON_PEND when the floating-point stack frame was allocated." edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="LSPEN" edc:desc="Enable automatic lazy state preservation for floating-point context." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ASPEN" edc:desc="Enables CONTROL.FPCA setting on execution of a floating-point instruction. This results in automatic hardware state preservation and restoration, for floating-point context, on exception entry and exit." edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
