Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70b/edc/ATSAMV70Q20B.PIC
      <edc:DCRDef edc:_addr="0x4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKBIT_WORD1" edc:factorydefault="0x0" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="LOCKBIT">
            <edc:DCRFieldDef edc:cname="LOCK_REGION_32" edc:desc="Lock Region 32" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_33" edc:desc="Lock Region 33" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_34" edc:desc="Lock Region 34" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_35" edc:desc="Lock Region 35" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_36" edc:desc="Lock Region 36" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_37" edc:desc="Lock Region 37" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_38" edc:desc="Lock Region 38" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_39" edc:desc="Lock Region 39" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_40" edc:desc="Lock Region 40" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_41" edc:desc="Lock Region 41" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_42" edc:desc="Lock Region 42" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_43" edc:desc="Lock Region 43" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_44" edc:desc="Lock Region 44" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_45" edc:desc="Lock Region 45" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_46" edc:desc="Lock Region 46" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_47" edc:desc="Lock Region 47" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_48" edc:desc="Lock Region 48" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_49" edc:desc="Lock Region 49" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_50" edc:desc="Lock Region 50" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_51" edc:desc="Lock Region 51" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_52" edc:desc="Lock Region 52" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_53" edc:desc="Lock Region 53" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_54" edc:desc="Lock Region 54" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_55" edc:desc="Lock Region 55" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_56" edc:desc="Lock Region 56" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_57" edc:desc="Lock Region 57" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_58" edc:desc="Lock Region 58" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_59" edc:desc="Lock Region 59" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_60" edc:desc="Lock Region 60" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_61" edc:desc="Lock Region 61" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_62" edc:desc="Lock Region 62" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_63" edc:desc="Lock Region 63" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PE1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DO0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="XIN" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="XOUT" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="HSDP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DSR0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA29" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RI1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TRACED2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DSR2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMEXTRG0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DO0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WKUP11" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RXD2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NWR1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NBS1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DQM1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWD1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MLBCLK" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TXD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="TDI" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DI0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SCK0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DAC0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDUTMIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="HSDM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DTR0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPCK" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD4" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="RI0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TRACED3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="RI2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NBS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="DQM0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="JTAGSEL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A22" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDCLE" edc:ppsfunction="A"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="WS" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD11" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VBG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NPCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA28" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="DSR1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCCDA" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMFI2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWCK1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MLBDAT" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WKUP13" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="TDO" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="TRACESWO" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A17" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="MCK" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WKUP0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="MLBSIG" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ADVREFP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ADVREFN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="UTXD3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DCD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="DAC1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDANA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TRACED0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DCD2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TRACED1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DTR2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMFI2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="ADTRG" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD29" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SDWE" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A21" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDALE" edc:ppsfunction="A"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A18" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="CK" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WKUP1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AD6" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD8" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AD10" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AD9" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDUTMI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDPLLUSB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDUTMII"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
